Autodesk.Revit.DB.Analysis.PathOfTravel.SetWaypoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Set the Way points along the path of travel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.GetWaypoints
return the waypoints set for the Path of Travel
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.UpdateMultiple(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus}@)
Updates the specified paths of travel by recalculating each path using their original start and end points and provides creation result statuses.
adoc:
Document of elements to be updated.
elementsToUpdate:
The list of ElementIdof the paths to update.
resultStatus:
Result statuses of each path of travel creation.
The order of statuses corresponds to the order of elements in the array passed to the function.
Returns:
number of successfully updated elements
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.UpdateMultiple(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Updates the specified paths of travel by recalculating each path using their original start and end points.
adoc:
Document of elements to be updated.
elementsToUpdate:
The list of ElementIdof the paths to update.
Returns:
number of successfully updated elements
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.Update
Updates the path of travel by recalculating the path between the original start and end points.
Returns:
The status result of the recalculation.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMapped(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start or end points are of zero size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The Z coordinates are ignored.
pathEnds:
The end points of the path. The Z coordinates are ignored.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The number of elements is the number of start points multiplied by the number of end points.
The order of elements corresponds to the order of end and then start points in the argument arrays:
s0->e0, s1->e0, ... , s0->e1, s1->e1... etc.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMapped(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus}@)
Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points and provides creation result statuses.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start or end points are of zero size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The Z coordinates are ignored.
pathEnds:
The end points of the path. The Z coordinates are ignored.
resultStatus:
Result statuses of each path of travel creation.
The order of statuses corresponds to the order of elements in the array returned by the function.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The number of elements is the number of start points multiplied by the number of end points.
The order of elements corresponds to the order of end and then start points in the argument arrays:
s0->e0, s1->e0, ... , s0->e1, s1->e1... etc.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMultiple(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus}@)
Creates multiple new paths of travel between same size sets of start and end points and provides creation result statuses.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start and end points are of different size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The Z coordinates are ignored.
pathEnds:
The end points of the path. The Z coordinates are ignored.
resultStatus:
Result statuses of each path of travel creation.
The order of statuses corresponds to the order of elements in the array returned by the function.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The order of elements corresponds to the order of start/end points in the argument arrays.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMultiple(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates multiple new paths of travel between same size sets of start and end points.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start and end points are of different size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The Z coordinates are ignored.
pathEnds:
The end points of the path. The Z coordinates are ignored.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The order of elements corresponds to the order of start/end points in the argument arrays.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new path of travel between two points.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split   View has crop box active and start or end point lies outside of the crop  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)  Start and end points are too close
DBView:
The floor plan view to use when computing the shortest distance.
pathStart:
The start point of the path. The Z coordinate is ignored.
pathEnd:
The end point of the path. The Z coordinate is ignored.
Returns:
The newly created path of travel element, or null if no path between the two points is found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus@)
Creates a new path of travel between two points and provides creation result status.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split   View has crop box active and start or end point lies outside of the crop  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)  Start and end points are too close
DBView:
The floor plan view to use when computing the shortest distance.
pathStart:
The start point of the path. The Z coordinate is ignored.
pathEnd:
The end point of the path. The Z coordinate is ignored.
resultStatus:
Result status of path of travel creation.
Returns:
The newly created path of travel element, or null if no path between the two points is found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CalculationStatus
Contains the current calculation status of the path of travel. Default is success for a newly created path.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.PathEnd
The end point of the path. The Z coordinate is ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The Path of Travel has waypoints set.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.PathStart
The start point of the path. The Z coordinate is ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The Path of Travel has waypoints set.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.PathMidpoint
The midpoint of the path. The Z coordinate is always zero.
Since:
2020